/**
 * Created by liyeg on 2020/08/07.
 */

const holiday: {
    solar: {[key: string]: string},
    lunar: {[key: string]: string},
} = {
    // 公历节日
    solar: {
        '01-01': '元旦',
        '02-14': '情人节',
        '03-08': '妇女节',
        '03-12': '植树节',
        '05-01': '劳动节',
        '05-04': '青年节',
        '05-12': '护士节',
        '06-01': '儿童节',
        '07-01': '建党节',
        '08-01': '建军节',
        '09-10': '教师节',
        '10-01': '国庆节',
        '11-01': '万圣节',
        '11-11': '光棍节',
        '12-24': '平安夜',
        '12-25': '圣诞节'
    },

    // 农历节日
    lunar: {
        '01-01': '春节',
        '01-15': '元宵节',
        '05-05': '端午节',
        '07-07': '七夕',
        '07-15': '中元节',
        '08-15': '中秋节',
        '09-09': '重阳节',
        '10-15': '下元节',
        '12-08': '腊八节',
        '12-30': '除夕'
    }
}

export default holiday;